Revit 2027 API
MeshFromGeometryOperationResult.GetIssues Method
 Returns the array of issues encountered while building a mesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<MeshFromGeometryOperationIssue> GetIssues()
Public Function GetIssues As IList(Of MeshFromGeometryOperationIssue)
public:
IList<MeshFromGeometryOperationIssue>^ GetIssues()
member GetIssues : unit -> IList<MeshFromGeometryOperationIssue>
Return Value
IList<MeshFromGeometryOperationIssue>
 Array of issues encountered while building a mesh.
See Also
Reference
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace